# Описание решения задачи
Написать программу, которая из имеющегося массива строк формирует массив из строк, длина которых меньше, либо равна 3 символа. Первоначадбный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. Не использовать коллекции

## 1.Метод ввода информации с клавиатуры
*Метод ничего не принимает, возвращает введенные пользователем данные в формате `string`.
Осуществляется проверка на предмет введения null значений ??""*
```
string ReadData()
{
    Console.WriteLine("Введите элементы массива");
    return Console.ReadLine()??"";
}
```

## 2. Преобразование строки в массив подстрок по разделителю с исключением лишних симсволов из строки
Используются встроенные String Method `Replace`, `Split`. Метод `Replace` заменяет элементы в строке ([] заменяется на пустой элемент). Метод `Split` разделяет строку на подстроки по разделителю, указанному в скобках. Метод `Split` возвращает массив подстрок.
```
string [] inputArray=inputString.Replace("[", "").Replace("]", "").Split(", ");
```

## 3. Метод обработки массива подстрок, исключение подстрок длиной более 3 символов
Создается новый массив. Длина нового массива не может превыщать длину входящего массива. Длина вновь создаваемого массива устанавливается аналогичной входящего.
В соответствии с условием задачи должны быть исключены элементы из массива длиной более 3 знаков. В программе реализовано условие исключения символов более 5 знаков, так как 2 знака составляют кавычки.
Цикл осуществляет перебор подстрок входящего массива подстрок. Если подстрока длинее 5 символов (3+""), то она не попадает в новый массив.
```
string [] ArrayFiltering(string [] inputArray)
{
    string [] outArray = new string[inputArray.Length];
    int j=0;
    int countElements=5;
    for(int i=0;i<inputArray.Length; i++)
    {
        if(inputArray[i].Length<=countElements)//
        {
            outArray[j]=inputArray[i];
            j++;
        }
    }
    return outArray; 
}
```
## 4. Метод печати массива подстрок
Метод принимает массив подстрок. Метод не осуществляет печать элементов с NULL значениями массива подстрок. NULL подстроки возникают из-за особенности работы методов `Replace`, `Split`.
Метод содержит оформительские особенности в части печати знаков [] и запятых, с целью соответствия условиям задачи по выводу информации.
```
void PrintArray(string [] inputArray)
{
    Console.Write("[");
    for(int i=0;i<inputArray.Length-1;i++)
    {
        if(inputArray[i]!=null)
        {
            if(i==0) Console.Write(inputArray[i]);
            else{Console.Write(","+ inputArray[i]);}
        }
    }
    Console.Write("]");
```
